/*
Технологично училище Електронни системи - http://http://www.elsys-bg.org/
11б клас
№18
Иван Пейчинов
Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>
#include<math.h>

#define MAX 10

int main()
{
	int i, x, z, a , b;
	float arr[MAX], sum = 0.0;
	
	do
	{
		printf("Vuvedi X : ");
		scanf("%d", &x);
		getchar();
	}while((x <= 0) && (x >= 1));
	
	for(i=0; i<MAX; i++)
	{
		sum = 0.0;
		a = i*x;
		b = (i+1)*x;
		for(z=a; z<b; z++)
		{
			sum += cos(z);
		}
		arr[i] = sum;
	}
	
	for(i = 0; i < MAX; i++)
	{
		printf("%d. = %f\n", i, arr[i]);
	}
	
	return 0;
}
